In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ["a", "b", "c"]

my_data = [10, 20, 30]

arr = np.array(my_data)

d = {"a":10, "b":20, "c":30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
series1 = pd.Series([1,2,3,4], ["Azerbaijan", "Turkey", "Israel", "US"])
series1

Azerbaijan    1
Turkey        2
Israel        3
US            4
dtype: int64

In [10]:
series1["Azerbaijan"]

1

In [11]:
series2 = pd.Series([1,2,3,4,5,6,7], 
                    ["Azerbaijan", "Azerbaijan", "Germany","Azerbaijan", "Azerbaijan", "Germany","Japan"])
series2

Azerbaijan    1
Azerbaijan    2
Germany       3
Azerbaijan    4
Azerbaijan    5
Germany       6
Japan         7
dtype: int64

In [12]:
series2["Azerbaijan"]

Azerbaijan    1
Azerbaijan    2
Azerbaijan    4
Azerbaijan    5
dtype: int64

In [13]:
series2[5]

6

In [14]:
series2 = pd.Series([1,2,3,4], ["Azerbaijan", "Turkey", "Israel", "US"])
series2

Azerbaijan    1
Turkey        2
Israel        3
US            4
dtype: int64

In [15]:
2 * series1

Azerbaijan    2
Turkey        4
Israel        6
US            8
dtype: int64

DataFrames

In [16]:
np.random.seed(101)

In [17]:
df = pd.DataFrame(np.random.randn(5,4), 
                  ["A", "B", "C", "D", "E"],
                  ["W", "X", "Y", "Z"])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df["X"]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [19]:
df[["W", "X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [20]:
df["new"] = df["W"] + df["Y"]
print(df)
print(df["new"])

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762
A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [21]:
df.drop("new", axis=1, inplace=True)

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df.drop("E", inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [24]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [25]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
df.loc["A", "X"]

0.6281327087844596

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [28]:
df.loc[ ["A", "B", "C"], 
        ["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

In [29]:
df.iloc[[0,1], 
        [0,1]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [30]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [31]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [32]:
df["W"] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [33]:
df["W"][df['W'] > 0]

A    2.706850
B    0.651118
D    0.188695
Name: W, dtype: float64

In [34]:
df[df["W"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [35]:
df[df["Z"] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [37]:
df = pd.DataFrame(np.random.randn(6,2), hier_index,["A", "B"])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [38]:
df.loc["G1"]

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [39]:
df.loc["G2"]

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [40]:
df.loc["G1"].loc[3]["B"]

0.39052784273374097

In [41]:
df = {"A":[1,2, np.nan], "B":[5, np.nan, np.nan], "C":[1,2,3]}

In [42]:
df = pd.DataFrame(df)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [43]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [44]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [45]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
df["A"].mean()

1.5